app/services/cart.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def total
    @items.inject(0) do |memo, item|
      memo += Book.find(item[0]).value * item[1]

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def items
    @items.map do |id, qty|
      {
        id: id,
        item: Book.find(id),
        qty: qty