app/models/concerns/image_saver.rb

  def save_image
    return unless data_stream.present?

    configure_image(find_image).save
---
INSERT INTO "images" ("title", "created_at", "updated_at", "imageable_id", "imageable_type") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Capa do livro"], ["created_at", "2024-04-11 11:15:43.394176"], ["updated_at", "2024-04-11 11:15:43.394176"], ["imageable_id", 1], ["imageable_type", "Book"]]