app/mailers/order_mailer.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def created(id)
    attachments.inline['logo.png'] = logo

    @order = Order.find(id)