app/views/order_mailer/created.text.erb

<% for item in @order.order_items %>
- <%= item.book.title %> - <%= item.quantity %> - <%= number_to_currency(item.value) %> - <%= number_to_currency(item.quantity * item.value) %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]