app/views/order_mailer/created.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 17]]
---
  <tbody>
    <% for item in @order.order_items %>