app/views/pub/order.html.erb

<ul id="order_items" >
  <% for item in @order.order_items %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]