app/controllers/books_controller.rb

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "person_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["person_id", 7], ["updated_at", "2024-04-11 11:56:01.346171"], ["id", 1]]

    def load_categories
      @categories = Category.all
---
SELECT "categories".* FROM "categories"