app/controllers/people_controller.rb

    def save_image
      return unless params[:data_stream].present?

      @image = (@person.image || Image.new(title: @person.name, person_id: @person.id))
      @image.data_stream = params[:data_stream]
      @image.height = 200
      @person.image = @image if @image.save
---
INSERT INTO "images" ("title", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Pedro"], ["person_id", 7], ["created_at", "2024-04-09 14:33:28.493132"], ["updated_at", "2024-04-09 14:33:28.493132"]]