app/controllers/pub_controller.rb

  def book
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def buy
    find_cart << Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def remove
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def close_order
    raise NotAuthenticated, 'Faça o login primeiro' if session[:id].blank?

    @cart = find_cart
    @order = Order.create_by_cart(session[:id], @cart.items)
---
INSERT INTO "orders" ("person_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?) RETURNING "id"  [["person_id", 7], ["created_at", "2024-04-15 20:15:55.907263"], ["updated_at", "2024-04-15 20:15:55.907263"], ["status", nil]]

  def order
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]