app/models/order.rb

INSERT INTO "order_items" ("order_id", "book_id", "quantity", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 1], ["book_id", 1], ["quantity", 2], ["value", 40.0], ["created_at", "2024-04-15 15:16:43.116774"], ["updated_at", "2024-04-15 15:16:43.116774"]]
INSERT INTO "orders" ("person_id", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["person_id", 7], ["created_at", "2024-04-15 15:16:43.115417"], ["updated_at", "2024-04-15 15:16:43.115417"]]
---
  def self.create_by_cart(person_id, items)
    order = Order.new(person_id: person_id)

    items.each do |item|
      item[:item].sell(item[:qty])

      order_item = OrderItem.new
      order_item.book = item[:item]
      order_item.quantity = item[:qty]
      order_item.value = item[:item].value

      order.order_items << order_item
    end

    order.save ? order : nil